app/controllers/movies_controller.rb

  def similar
    id = params[:id]
    @movies = Movie.find_same_director(id)
    if not @movies
      flash[:notice]="'#{Movie.find_by_id(id).title}' has no director info"
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1